# Probability Encoding

In [21]:
import pandas as pd

In [26]:
import pandas as pd
import numpy as np

In [28]:
df=pd.read_csv('train.csv')

In [29]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
columns=['Survived','Cabin']
df=df[columns]

In [31]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [32]:
df['Cabin']=df['Cabin'].fillna('Missing')

In [34]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [36]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [40]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [42]:
Prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [46]:
Prob_df=pd.DataFrame(Prob_df)
Prob_df.head()

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000

In [47]:
Prob_df['Died']=1-Prob_df['Survived']

In [57]:
Prob_df['Ratio']=Prob_df['Survived']/Prob_df['Died']

In [58]:
Prob_encode= Prob_df['Ratio'].to_dict()

In [65]:
df['Encode']=df['Cabin'].map(Prob_encode)

In [66]:
df.head()

   Survived Cabin    Encode
0         0     M  0.428274
1         1     C  1.458333
2         1     M  0.428274
3         1     C  1.458333
4         0     M  0.428274